In [ ]:
# pour charger un .sql utiliser terminal de commande mysql workbench
# mysql -u root -p nom_de_la_base_de_donnees < mon/chemin/nom_du_fichier.sql
# mysql -u root -p admin foodly2<c:\testprg\foodly.sql
#dans terminal workbench taper creer dabord la bdd exemple foodly2 present dans foodly.sql => create database foodly2 ensuite
# use foodly2 et mysql> source c:/testprg/foodly.sql

In [1]:
# le ws est de suivre le tuto https://openclassrooms.com/fr/courses/6971126-implementez-vos-bases-de-donnees-relationnelles-avec-sql/7142248-inserez-des-donnees-dans-votre-bdd
#au prealable installer ipython en terminal de commande via: pip install ipython-sql
#tout cela nous permettra d'utiliser du python et sql dans les cell jupiter
import sqlalchemy

In [2]:
# mettre mysql+mysqlconnector et pas seulement mysql, on cree une instance du moteur de bdd mysql
sqlalchemy.create_engine("mysql+mysqlconnector://root:admin@localhost/")

Engine(mysql+mysqlconnector://root:***@localhost/)

In [3]:
#chargement du module SQL pour saisir directement du sql dans python (jupiter)
%load_ext sql

In [4]:
#connection Ã  la bdd
%sql mysql+mysqlconnector://root:admin@localhost/

In [5]:
%sql create database foodly;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [6]:
%sql use foodly;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [7]:
%%sql
CREATE TABLE utilisateur (
id INTEGER NOT NULL AUTO_INCREMENT PRIMARY KEY,
nom VARCHAR(100),
prenom VARCHAR(100),
email VARCHAR(255) NOT NULL UNIQUE
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [8]:
%sql select * from utilisateur

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [9]:
%%sql
CREATE TABLE aliment (
id INTEGER NOT NULL AUTO_INCREMENT PRIMARY KEY,
nom VARCHAR(100) NOT NULL,
marque VARCHAR(100),
sucre FLOAT,
calories INTEGER NOT NULL,
graisses FLOAT,
proteines FLOAT,
bio BOOLEAN DEFAULT false
);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [10]:
%sql select * from aliment;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [11]:
%sql show tables;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('aliment',), ('utilisateur',)]

In [12]:
%sql show columns from utilisateur;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('nom', 'varchar(100)', 'YES', '', None, ''),
 ('prenom', 'varchar(100)', 'YES', '', None, ''),
 ('email', 'varchar(255)', 'NO', 'UNI', None, '')]

In [13]:
%sql show columns from aliment;

 * mysql+mysqlconnector://root:***@localhost/
8 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('nom', 'varchar(100)', 'NO', '', None, ''),
 ('marque', 'varchar(100)', 'YES', '', None, ''),
 ('sucre', 'float', 'YES', '', None, ''),
 ('calories', 'int', 'NO', '', None, ''),
 ('graisses', 'float', 'YES', '', None, ''),
 ('proteines', 'float', 'YES', '', None, ''),
 ('bio', 'tinyint(1)', 'YES', '', '0', '')]

In [14]:
%sql show tables;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('aliment',), ('utilisateur',)]

In [ ]:
#INSERT

In [15]:
%%sql
INSERT INTO `utilisateur` (`nom`, `prenom`, `email`)
VALUES ('Durantay', 'Quentin', 'quentin@gmail.com');

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [16]:
%%sql
INSERT INTO `utilisateur` (`nom`, `prenom`, `email`)
VALUES
('Doe', 'John', 'john@yahoo.fr'),
('Smith', 'Jane', 'jane@hotmail.com'),
('Dupont', 'Sebastien', 'sebastien@orange.fr'),
('Martin', 'Emilie', 'emilie@gmail.com');

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[]

In [17]:
%%sql
INSERT INTO `aliment` (`nom`, `marque`, `sucre`, `calories`, `graisses`, `proteines`, `bio`)
VALUES
('poire', 'monoprix', 27.5, 134, 0.2, 1.1, FALSE),
('pomme', 'monoprix', 19.1, 72, 0.2, 0.4, FALSE),
('oeuf', 'carrefour', 0.6, 82, 5.8, 6.9, TRUE),
('lait d\'amande', 'bjorg', 4.5, 59, 3.9, 1.1, TRUE);

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[]

In [18]:
#exemple d'erreur si on n'affecte pas la valeur par defaut
%%sql
INSERT INTO `utilisateur` (`nom`, `prenom`)
VALUES ('Hello', 'World');

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.DatabaseError) 1364 (HY000): Field 'email' doesn't have a default value
[SQL: INSERT INTO `utilisateur` (`nom`, `prenom`)
VALUES ('Hello', 'World');]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

In [19]:
%%sql
INSERT INTO `aliment` (`nom`, `marque`, `sucre`, `calories`, `graisses`, `proteines`, `bio`)
VALUES
('haricots verts', 'Monoprix', 25, 3, 0, 1.7, FALSE);

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [20]:
%sql select * from utilisateur;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[(1, 'Durantay', 'Quentin', 'quentin@gmail.com'),
 (2, 'Doe', 'John', 'john@yahoo.fr'),
 (3, 'Smith', 'Jane', 'jane@hotmail.com'),
 (4, 'Dupont', 'Sebastien', 'sebastien@orange.fr'),
 (5, 'Martin', 'Emilie', 'emilie@gmail.com')]

In [21]:
%sql SELECT `nom`, `prenom`, `email` FROM utilisateur;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('Durantay', 'Quentin', 'quentin@gmail.com'),
 ('Doe', 'John', 'john@yahoo.fr'),
 ('Smith', 'Jane', 'jane@hotmail.com'),
 ('Dupont', 'Sebastien', 'sebastien@orange.fr'),
 ('Martin', 'Emilie', 'emilie@gmail.com')]

In [22]:
#on peut apparement utiliser les ' ou ` ou rien mais vaut mieux les guillemet pour que le code soit bien lisible
%sql select nom,calories from aliment;

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('poire', 134),
 ('pomme', 72),
 ('oeuf', 82),
 ("lait d'amande", 59),
 ('haricots verts', 3)]

In [ ]:
#UPDATE

In [24]:
%%sql 
UPDATE `utilisateur` SET `email` = 'quentind@gmail.com' WHERE `id` = '1';
SELECT * FROM `utilisateur` WHERE `id` = '1';

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.
1 rows affected.

[(1, 'Durantay', 'Quentin', 'quentind@gmail.com')]

In [ ]:
#DELETE

In [25]:
%%sql
DELETE FROM `utilisateur` WHERE `id` = '2';

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [ ]:
#%sql DROP TABLE `utilisateur`;
#DROP DATABASE foodly ;
#ATTENTION Ã  UTILISER AVEC PRECAUTION

In [ ]:
#on va dire quâon sâest complÃ¨tement trompÃ© pour notre pomme golden. MÃªme en la modifiant prÃ©cÃ©demment dans la BDD de Foodly, les donnÃ©es sont complÃ¨tement fausses. Comment feriez-vous pour la supprimer dÃ©finitivement de la BDD ?

In [ ]:
#attention au guillement....

In [31]:
%sql DELETE FROM "aliment" WHERE "nom"='pomme';

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[]

In [32]:
#extraire des donnÃ©es
%sql SELECT * FROM aliment WHERE id = 4;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(4, "lait d'amande", 'bjorg', 4.5, 59, 3.9, 1.1, 1)]

In [34]:
%sql SELECT * FROM "aliment" WHERE "nom" = 'poire';

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(1, 'poire', 'monoprix', 27.5, 134, 0.2, 1.1, 0)]

In [35]:
%sql SELECT * FROM aliment WHERE calories < 90;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(3, 'oeuf', 'carrefour', 0.6, 82, 5.8, 6.9, 1),
 (4, "lait d'amande", 'bjorg', 4.5, 59, 3.9, 1.1, 1),
 (5, 'haricots verts', 'Monoprix', 25.0, 3, 0.0, 1.7, 0)]

In [37]:
%sql SELECT * FROM "utilisateur" WHERE "email" LIKE '%gmail.com';

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(1, 'Durantay', 'Quentin', 'quentind@gmail.com'),
 (5, 'Martin', 'Emilie', 'emilie@gmail.com')]

In [38]:
%sql SELECT * FROM "aliment" ORDER BY "calories" ASC;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(5, 'haricots verts', 'Monoprix', 25.0, 3, 0.0, 1.7, 0),
 (4, "lait d'amande", 'bjorg', 4.5, 59, 3.9, 1.1, 1),
 (3, 'oeuf', 'carrefour', 0.6, 82, 5.8, 6.9, 1),
 (1, 'poire', 'monoprix', 27.5, 134, 0.2, 1.1, 0)]

In [39]:
%%sql
SELECT * 
FROM aliment 
WHERE (calories < 90)  AND (sucre >10) 
ORDER BY calories DESC;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(5, 'haricots verts', 'Monoprix', 25.0, 3, 0.0, 1.7, 0)]

In [42]:
%sql select * from "aliment" where "bio"=0 order by "proteines" desc;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(5, 'haricots verts', 'Monoprix', 25.0, 3, 0.0, 1.7, 0),
 (1, 'poire', 'monoprix', 27.5, 134, 0.2, 1.1, 0)]

In [108]:
%%sql
SELECT COUNT(*) 
FROM utilisateur
WHERE email LIKE "%gmail.com";

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(4,)]

In [72]:
%%sql
SELECT * 
FROM aliment 
WHERE nom like "%pomme%";

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[(1, 'pomme', 'sans marque', 19.1, 72, 0.2, 0.4, 0),
 (16, 'jus de pomme', 'andros', 24.0, 100, 0.2, 0.2, 1),
 (17, 'pomme de terre', 'dorÃ©ac', 21.1, 104, 0.2, 2.8, 0)]

In [75]:
%%sql
SELECT COUNT(nom) 
FROM aliment 
WHERE nom LIKE "%pomme%";

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(3,)]

In [ ]:
#Mais on sait qu'il y a 3 produits qui ont 'pomme' dans leur nom et que ces 3 produits sont bien distincts. Il n'y a donc pas de doublons dans le nom des produits contenant le mot pomme.

In [88]:
%%sql
SELECT COUNT(DISTINCT nom) 
FROM aliment 
WHERE nom LIKE "%pomme%";

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(3,)]

In [ ]:
#alias

In [94]:
%%sql
SELECT COUNT(DISTINCT nom)  AS "produits diffÃ©rents contenant le mot pomme"
FROM aliment 
WHERE nom LIKE "%pomme%";

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(3,)]

In [ ]:
#operation agregation

In [95]:
%%sql
SELECT MAX(sucre)  AS "taux de sucre maximum"
FROM aliment;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(64.0,)]

In [98]:
%%sql
SELECT ROUND(AVG(calories)) AS "calories moyennes des aliments > 30g"
FROM aliment 
WHERE calories > 30;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(Decimal('120'),)]

In [ ]:
#creer une vue

In [ ]:
%%sql
CREATE VIEW utilisateurs_gmail_vw AS 
    (   SELECT * 
        FROM utilisateur 
        WHERE email LIKE "%gmail.com"
    )

In [103]:
%sql SELECT * from utilisateurs_gmail_vw;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(1, 'Durantay', 'Quentin', 'quentind@gmail.com'),
 (5, 'Martin', 'Emilie', 'emilie@gmail.com')]

In [104]:
%%sql
SELECT * 
FROM utilisateurs_gmail_vw 
WHERE prenom LIKE "%m%";

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[(5, 'Martin', 'Emilie', 'emilie@gmail.com')]

In [ ]:
#Essayez Ã  prÃ©sent par vous-mÃªme la crÃ©ation d'une vue. CrÃ©ez une vue reprenant notre liste des aliments non bio, classÃ©s par contenance en protÃ©ines (de maniÃ¨re dÃ©croissante).

In [105]:
%%sql
CREATE VIEW aliment_bio_vw AS 
    (   SELECT * 
        FROM aliment 
        WHERE bio=0 ORDER BY proteines DESC
    )

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [106]:
%sql SELECT * FROM aliment_bio_vw

 * mysql+mysqlconnector://root:***@localhost/
14 rows affected.

[(12, 'filet de poulet', 'le gaulois', 0.0, 121, 1.8, 26.2, 0),
 (7, 'saumon', 'guyader', 0.0, 206, 12.3, 22.1, 0),
 (11, 'blanc de dinde', 'pÃ¨re dodu', 0.6, 98, 0.9, 22.0, 0),
 (19, 'baguette', 'sans marque', 36.1, 185, 1.2, 7.5, 0),
 (4, 'jambon', 'herta', 0.2, 34, 0.8, 6.6, 0),
 (6, 'steak hachÃ©', 'charal', 0.8, 68, 4.8, 4.8, 0),
 (17, 'pomme de terre', 'dorÃ©ac', 21.1, 104, 0.2, 2.8, 0),
 (9, 'riz', 'oncle benz', 28.2, 130, 0.3, 2.7, 0),
 (15, "jus d'orange", 'innocent', 16.0, 74, 0.0, 1.6, 0),
 (8, 'haricots verts', 'bonduelle', 5.8, 25, 0.1, 1.5, 0),
 (3, 'banane', 'chiquita', 24.0, 101, 0.3, 1.1, 0),
 (5, 'compote', 'andros', 11.0, 51, 0.0, 0.5, 0),
 (1, 'pomme', 'sans marque', 19.1, 72, 0.2, 0.4, 0),
 (14, 'cafÃ©', 'carte noire', 0.0, 0, 0.0, 0.0, 0)]

In [ ]:
#jointure

In [111]:
%%sql
SELECT utilisateur.id, UPPER(utilisateur.nom) AS "NOM", utilisateur.prenom, utilisateur.email,langue.nom AS "LANGUE" FROM utilisateur
JOIN langue
ON utilisateur.langue_id = langue.id
WHERE (utilisateur.email LIKE "%gmail%") AND (langue.id=1) 
ORDER BY utilisateur.id DESC;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(6, 'DE VAUCLERC', 'lisa', 'lisadv@gmail.com', 'franÃ§ais'),
 (1, 'DURANTAY', 'quentin', 'qentin@gmail.com', 'franÃ§ais')]

In [107]:
%%sql
SELECT * 
FROM utilisateur
JOIN langue
ON utilisateur.langue_id = langue.id;

 * mysql+mysqlconnector://root:***@localhost/
10 rows affected.

[(1, 'durantay', 'quentin', 'qentin@gmail.com', 1, 1, 'franÃ§ais'),
 (2, 'dupont', 'marie', 'marie@hotmail.fr', 1, 1, 'franÃ§ais'),
 (5, 'paul', 'pierre', 'pp@orange.fr', 1, 1, 'franÃ§ais'),
 (6, 'de vauclerc', 'lisa', 'lisadv@gmail.com', 1, 1, 'franÃ§ais'),
 (7, 'gluntig', 'Ã©lÃ©onore', 'glunt@sfr.com', 1, 1, 'franÃ§ais'),
 (10, 'tember', 'fabienne', 'fabienne@yopmail.com', 1, 1, 'franÃ§ais'),
 (3, 'miller', 'vincent', 'vm@yahoo.com', 2, 2, 'anglais'),
 (4, 'zuckerberg', 'marc', 'marc@gmail.com', 2, 2, 'anglais'),
 (8, 'cavill', 'henry', 'henry@outlook.fr', 2, 2, 'anglais'),
 (9, 'hopper', 'lionel', 'hpp@gmail.com', 2, 2, 'anglais')]

In [ ]:
#Admettons que je vous demande de me donner tous les noms de famille des utilisateurs ayant sÃ©lectionnÃ© le franÃ§ais. Comment feriez-vous cela ?

In [113]:
%%sql
SELECT utilisateur.nom, langue.nom FROM utilisateur JOIN langue
ON utilisateur.langue_id = langue.id
WHERE langue.id=1;

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[('durantay', 'franÃ§ais'),
 ('dupont', 'franÃ§ais'),
 ('paul', 'franÃ§ais'),
 ('de vauclerc', 'franÃ§ais'),
 ('gluntig', 'franÃ§ais'),
 ('tember', 'franÃ§ais')]

In [ ]:
#   deux tables ayant une relation plusieurs Ã  plusieurs, via leur table de liaison
#   Un mÃªme utilisateur peut stocker plusieurs aliments scannÃ©s ;
#   Un aliment peut lui-mÃªme Ãªtre scannÃ© par plusieurs utilisateurs.

In [114]:
%%sql
SELECT *
FROM utilisateur
JOIN utilisateur_aliment ON (utilisateur.id = utilisateur_aliment.utilisateur_id)
JOIN aliment ON (aliment.id = utilisateur_aliment.aliment_id);

 * mysql+mysqlconnector://root:***@localhost/
29 rows affected.

[(1, 'durantay', 'quentin', 'qentin@gmail.com', 1, 1, 7, 7, 'saumon', 'guyader', 0.0, 206, 12.3, 22.1, 0),
 (1, 'durantay', 'quentin', 'qentin@gmail.com', 1, 1, 3, 3, 'banane', 'chiquita', 24.0, 101, 0.3, 1.1, 0),
 (1, 'durantay', 'quentin', 'qentin@gmail.com', 1, 1, 5, 5, 'compote', 'andros', 11.0, 51, 0.0, 0.5, 0),
 (1, 'durantay', 'quentin', 'qentin@gmail.com', 1, 1, 17, 17, 'pomme de terre', 'dorÃ©ac', 21.1, 104, 0.2, 2.8, 0),
 (2, 'dupont', 'marie', 'marie@hotmail.fr', 1, 2, 2, 2, 'poire', 'sans marque', 27.5, 134, 0.2, 1.1, 1),
 (2, 'dupont', 'marie', 'marie@hotmail.fr', 1, 2, 19, 19, 'baguette', 'sans marque', 36.1, 185, 1.2, 7.5, 0),
 (2, 'dupont', 'marie', 'marie@hotmail.fr', 1, 2, 14, 14, 'cafÃ©', 'carte noire', 0.0, 0, 0.0, 0.0, 0),
 (3, 'miller', 'vincent', 'vm@yahoo.com', 2, 3, 4, 4, 'jambon', 'herta', 0.2, 34, 0.8, 6.6, 0),
 (3, 'miller', 'vincent', 'vm@yahoo.com', 2, 3, 15, 15, "jus d'orange", 'innocent', 16.0, 74, 0.0, 1.6, 0),
 (3, 'miller', 'vincent', 'vm@yahoo.com', 2, 3, 12, 12, 'filet de poulet', 'le gaulois', 0.0, 121, 1.8, 26.2, 0),
 (4, 'zuckerberg', 'marc', 'marc@gmail.com', 2, 4, 5, 5, 'compote', 'andros', 11.0, 51, 0.0, 0.5, 0),
 (4, 'zuckerberg', 'marc', 'marc@gmail.com', 2, 4, 4, 4, 'jambon', 'herta', 0.2, 34, 0.8, 6.6, 0),
 (4, 'zuckerberg', 'marc', 'marc@gmail.com', 2, 4, 7, 7, 'saumon', 'guyader', 0.0, 206, 12.3, 22.1, 0),
 (5, 'paul', 'pierre', 'pp@orange.fr', 1, 5, 1, 1, 'pomme', 'sans marque', 19.1, 72, 0.2, 0.4, 0),
 (5, 'paul', 'pierre', 'pp@orange.fr', 1, 5, 18, 18, 'oeuf', 'naturalia', 0.4, 74, 5.1, 6.5, 1),
 (5, 'paul', 'pierre', 'pp@orange.fr', 1, 5, 3, 3, 'banane', 'chiquita', 24.0, 101, 0.3, 1.1, 0),
 (6, 'de vauclerc', 'lisa', 'lisadv@gmail.com', 1, 6, 2, 2, 'poire', 'sans marque', 27.5, 134, 0.2, 1.1, 1),
 (6, 'de vauclerc', 'lisa', 'lisadv@gmail.com', 1, 6, 12, 12, 'filet de poulet', 'le gaulois', 0.0, 121, 1.8, 26.2, 0),
 (6, 'de vauclerc', 'lisa', 'lisadv@gmail.com', 1, 6, 6, 6, 'steak hachÃ©', 'charal', 0.8, 68, 4.8, 4.8, 0),
 (7, 'gluntig', 'Ã©lÃ©onore', 'glunt@sfr.com', 1, 7, 16, 16, 'jus de pomme', 'andros', 24.0, 100, 0.2, 0.2, 1),
 (7, 'gluntig', 'Ã©lÃ©onore', 'glunt@sfr.com', 1, 7, 19, 19, 'baguette', 'sans marque', 36.1, 185, 1.2, 7.5, 0),
 (7, 'gluntig', 'Ã©lÃ©onore', 'glunt@sfr.com', 1, 7, 1, 1, 'pomme', 'sans marque', 19.1, 72, 0.2, 0.4, 0),
 (8, 'cavill', 'henry', 'henry@outlook.fr', 2, 8, 3, 3, 'banane', 'chiquita', 24.0, 101, 0.3, 1.1, 0),
 (8, 'cavill', 'henry', 'henry@outlook.fr', 2, 8, 5, 5, 'compote', 'andros', 11.0, 51, 0.0, 0.5, 0),
 (9, 'hopper', 'lionel', 'hpp@gmail.com', 2, 9, 18, 18, 'oeuf', 'naturalia', 0.4, 74, 5.1, 6.5, 1),
 (9, 'hopper', 'lionel', 'hpp@gmail.com', 2, 9, 9, 9, 'riz', 'oncle benz', 28.2, 130, 0.3, 2.7, 0),
 (9, 'hopper', 'lionel', 'hpp@gmail.com', 2, 9, 14, 14, 'cafÃ©', 'carte noire', 0.0, 0, 0.0, 0.0, 0),
 (10, 'tember', 'fabienne', 'fabienne@yopmail.com', 1, 10, 16, 16, 'jus de pomme', 'andros', 24.0, 100, 0.2, 0.2, 1),
 (10, 'tember', 'fabienne', 'fabienne@yopmail.com', 1, 10, 3, 3, 'banane', 'chiquita', 24.0, 101, 0.3, 1.1, 0)]

In [ ]:
#ALTER TABLE

In [115]:
%sql SHOW COLUMNS FROM aliment;

 * mysql+mysqlconnector://root:***@localhost/
8 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('nom', 'varchar(100)', 'NO', '', None, ''),
 ('marque', 'varchar(100)', 'YES', '', None, ''),
 ('sucre', 'float', 'YES', '', None, ''),
 ('calories', 'int', 'NO', '', None, ''),
 ('graisses', 'float', 'YES', '', None, ''),
 ('proteines', 'float', 'YES', '', None, ''),
 ('bio', 'tinyint(1)', 'YES', '', '0', '')]

In [116]:
%sql ALTER TABLE aliment ADD vitamince_c float;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [117]:
%sql SHOW COLUMNS FROM aliment;

 * mysql+mysqlconnector://root:***@localhost/
9 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('nom', 'varchar(100)', 'NO', '', None, ''),
 ('marque', 'varchar(100)', 'YES', '', None, ''),
 ('sucre', 'float', 'YES', '', None, ''),
 ('calories', 'int', 'NO', '', None, ''),
 ('graisses', 'float', 'YES', '', None, ''),
 ('proteines', 'float', 'YES', '', None, ''),
 ('bio', 'tinyint(1)', 'YES', '', '0', ''),
 ('vitamince_c', 'float', 'YES', '', None, '')]

In [ ]:
#Faisons un petit exercice :
#Admettons que lâon souhaite rajouter une colonne Ã  la table âlangueâ. Cette colonne, câest le code ISO des langues (par exemple : âfr-frâ pour le FranÃ§ais de mÃ©tropole).
#Comment feriez-vous cela ?
#Tentez de crÃ©er la colonne et de la remplir par vous-mÃªme pour le FranÃ§ais et lâAnglais

In [118]:
%sql SHOW COLUMNS FROM langue;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('nom', 'varchar(100)', 'NO', '', None, '')]

In [119]:
%sql ALTER TABLE langue ADD code_iso VARCHAR(20);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [120]:
%sql SHOW COLUMNS FROM langue;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('nom', 'varchar(100)', 'NO', '', None, ''),
 ('code_iso', 'varchar(20)', 'YES', '', None, '')]

In [122]:
%sql SELECT * FROM langue;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(1, 'franÃ§ais', None), (2, 'anglais', None)]

In [123]:
%%sql
UPDATE langue SET code_iso="fr-fr" WHERE id=1;
UPDATE langue SET code_iso="en" WHERE id=2;

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.
1 rows affected.

[]

In [124]:
%sql SELECT * FROM langue;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(1, 'franÃ§ais', 'fr-fr'), (2, 'anglais', 'en')]

In [125]:
%sql ALTER TABLE aliment DROP bio;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [126]:
%sql SELECT * FROM aliment;

 * mysql+mysqlconnector://root:***@localhost/
20 rows affected.

[(1, 'pomme', 'sans marque', 19.1, 72, 0.2, 0.4, None),
 (2, 'poire', 'sans marque', 27.5, 134, 0.2, 1.1, None),
 (3, 'banane', 'chiquita', 24.0, 101, 0.3, 1.1, None),
 (4, 'jambon', 'herta', 0.2, 34, 0.8, 6.6, None),
 (5, 'compote', 'andros', 11.0, 51, 0.0, 0.5, None),
 (6, 'steak hachÃ©', 'charal', 0.8, 68, 4.8, 4.8, None),
 (7, 'saumon', 'guyader', 0.0, 206, 12.3, 22.1, None),
 (8, 'haricots verts', 'bonduelle', 5.8, 25, 0.1, 1.5, None),
 (9, 'riz', 'oncle benz', 28.2, 130, 0.3, 2.7, None),
 (10, 'pÃ¢tes completes', 'barilla', 64.0, 353, 2.7, 14.0, None),
 (11, 'blanc de dinde', 'pÃ¨re dodu', 0.6, 98, 0.9, 22.0, None),
 (12, 'filet de poulet', 'le gaulois', 0.0, 121, 1.8, 26.2, None),
 (13, 'muesli', 'bjorg', 26.5, 170, 5.0, 3.5, None),
 (14, 'cafÃ©', 'carte noire', 0.0, 0, 0.0, 0.0, None),
 (15, "jus d'orange", 'innocent', 16.0, 74, 0.0, 1.6, None),
 (16, 'jus de pomme', 'andros', 24.0, 100, 0.2, 0.2, None),
 (17, 'pomme de terre', 'dorÃ©ac', 21.1, 104, 0.2, 2.8, None),
 (18, 'oeuf', 'naturalia', 0.4, 74, 5.1, 6.5, None),
 (19, 'baguette', 'sans marque', 36.1, 185, 1.2, 7.5, None),
 (20, "lait d'amande", 'bjorg', 6.1, 80, 5.3, 1.5, None)]

In [ ]:
#Les dÃ©veloppeurs viennent vous voir affolÃ©s ! Certains utilisateurs ne peuvent pas sâinscrire car leur e-mail dÃ©passe les 255 caractÃ¨res.
#Pourriez-vous augmenter la limite Ã  500 ?

In [128]:
%sql ALTER TABLE utilisateur MODIFY email VARCHAR(255);

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [130]:
%sql SHOW COLUMNS FROM utilisateur

 * mysql+mysqlconnector://root:***@localhost/
5 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('nom', 'varchar(100)', 'YES', '', None, ''),
 ('prenom', 'varchar(100)', 'YES', '', None, ''),
 ('email', 'varchar(255)', 'YES', 'UNI', None, ''),
 ('langue_id', 'int', 'NO', 'MUL', None, '')]

In [131]:
%sql ALTER TABLE aliment CHANGE sucre sucres FLOAT;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [133]:
%sql SHOW COLUMNS FROM aliment

 * mysql+mysqlconnector://root:***@localhost/
8 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('nom', 'varchar(100)', 'NO', '', None, ''),
 ('marque', 'varchar(100)', 'YES', '', None, ''),
 ('sucres', 'float', 'YES', '', None, ''),
 ('calories', 'int', 'NO', '', None, ''),
 ('graisses', 'float', 'YES', '', None, ''),
 ('proteines', 'float', 'YES', '', None, ''),
 ('vitamince_c', 'float', 'YES', '', None, '')]

In [ ]:
#Ã prÃ©sent, les dÃ©veloppeurs trouvent que le nom âcode_isoâ dans la table des langues est peu explicite. Ils aimeraient quâelle sâappelle âcode_paysâ.
#Pouvez-vous implÃ©menter ce changement ?

In [141]:
%%sql
ALTER TABLE langue CHANGE code_iso code_pays VARCHAR(255);
SHOW COLUMNS FROM langue;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
3 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('nom', 'varchar(100)', 'NO', '', None, ''),
 ('code_pays', 'varchar(255)', 'YES', '', None, '')]